"""
3 Задайте список из n чисел последовательности (1 + 1 / n)**n и выведите на экран 
их сумму.

*Пример:*
- Для n = 6: [2.0, 2.25, 2.37, 2.44, 2.488, 2.52]     ->       14.072    
(Округлять не обязательно)
"""

print("Введите число N: ")
num = int(input())
#sum = 0
list_1 = []

for i in range(1, num + 1):
    a = (1 + 1 / i) ** i
    #sum += a
    list_1.append(round(a, 2))

#print(f"Для n = {num}: {list_1} -> {round(sum, 2)} ")
print(f"Для n = {num}: {list_1} -> {round(sum(list_1), 2)} ")
